#pragma once
#include <vector>
#include <string>
#include <fstream>





const std::vector<std::string> surnames = { "Иванов",
"Петров",
"Смирнов",
"Михайлов",
"Фёдоров",
"Соколов",
"Яковлев",
"Андреев",
"Алексеев",
"Александров",
"Лебедев",
"Степанов",
"Семёнов",
"Павлов",
"Николаев",
"Дмитриев",
"Волков",
"Кузнецов",
"Никитин",
"Соловьёв" };



const std::vector<std::string> names= { "Григорий",
"Лев",
"Роман",
"Арсений",
"Степан",
"Владислав",
"Никита",
"Марк",
"Ярослав",
"Евгений",
"Фёдор",
"Николай",
"Андрей",
"Виктор",
"Никита",
"Даниил",
"Денис",
"Егор",
"Павел",
"Роман" };



const std::vector<std::string> patronymics = { "Александрович",
"Алексеевич",
"Андреевич",
"Антонович",
"Аркадьевич",
"Борисович",
"Валентинович",
"Валерьевич",
"Васильевич",
"Викторович",
"Владимирович",
"Данилович",
"Дмитриевич",
"Евгеньевич",
"Иванович",
"Игоревич",
"Кириллович",
"Константинович",
"Максимович",
"Николаевич" };



const std::vector<std::string> cities = { "Москва",
"Хабаровск",
"Кисловодск",
"Кострома",
"Краснодар",
"Красноярск",
"Курган",
"Курск",
"Липецк",
"Листвянка",
"Магадан",
"Магнитогорск",
"Махачкала",
"Мурманск",
"Находка",
"Нальчик",
"Нижневартовск",
"Тольятти",
"Ноябрьск",
"Норильск",
"Новокузнецк",
"Новороссийск" };



const std::vector<std::string> organisationType {"ООО", "ОАО", "ИП"};



const std::vector<std::string> months { " января ",
" февраля ",
" марта ",
" апреля ",
" мая ",
" июня ",
" июля ",
" августа ",
" сентября ",
" октября ",
" ноября ",
" декабря " };



const int NDFL = 13; // НДФЛ
const int MROT = 13000; // МРОТ



class TaxReport
{
public:

	int id;

	std::string surname;     // Ф
	std::string name;        // И
	std::string patronymic;  // О

	std::string city; // Город

	std::vector<int> DateOfBirth; // Дата рождения

	long long int INN; // ИНН
	int KPP; // КПП
	std::vector<int> yearOfReport; // Отчётный год

	std::string type; // Оргазизационно-правовая форма

	int yearIncome; // Годовой доход
	int amountOfWorkingDays; // Кол-во рабочих дней

	double toPay; // Итого к оплате
	bool status; // Статус оплаты

	TaxReport();
	TaxReport(const long int& id); 
	

	void printTaxReportToFile(std::ofstream& file);
};

